import { useState } from "react"
import "./home.css"
import showImage from '../show.png'
import noneshowImage from '../noun-plus-2178969.png'
import { FontAwesomeIcon } from '@fortawesome/react-fontawesome'
import {faCirclePlus ,faCircleMinus } from '@fortawesome/free-solid-svg-icons'
export default function Banks(){
   
const [shwo,setShow]=useState(false)
const [shwo2,setShow2]=useState(false)
const [shwo3,setShow3]=useState(false)
const [shwo4,setShow4]=useState(false)
const [shwo5,setShow5]=useState(false)
const [shwo6,setShow6]=useState(false)
const [shwo7,setShow7]=useState(false)
const [shwo8,setShow8]=useState(false)

const handleShow =()=>{
   setShow(!shwo)


}

const handleShow2 =()=>{
   setShow2(!shwo2)


}
const handleShow3 =()=>{
   setShow3(!shwo3)


}
const handleShow4 =()=>{
   setShow4(!shwo4)

}
const handleShow5 =()=>{
   setShow5(!shwo5)

}
const handleShow6 =()=>{
   setShow6(!shwo6)

}
const handleShow7 =()=>{
   setShow7(!shwo7)


}

const handleShow8 =()=>{
   setShow8(!shwo8)


}
    return(
        <div className="container"> 
            <div className="row" style={{backgroundColor:"white"   ,  marginTop:" 30px"}}>
 
             <div className="col-4 box bank" style={{marginTop:"0px"}}>
               <h4 style={{color:"white" , marginTop:"10px" , textAlign:"center",padding:"5px"}}><b>سياسة الأهلي</b>
               <span >
               <button onClick={handleShow} className="btn-show">
             
              
              
               
                
                  <span>{shwo?  <FontAwesomeIcon icon={faCircleMinus} flip="both" style={{color: "#374fc8",fontSize:"1.3rem"}} />:<FontAwesomeIcon icon={faCirclePlus} flip="both" style={{color: "#374fc8",fontSize:"1.3rem"}} />}
                  <span style={{padding:"10px"}}>{shwo? "اخفاء":"اظهار" }
          
                  </span>
                  </span>
               </button>
               </span>

               {/* <div class="form-check form-switch">
  <input class="form-check-input" type="checkbox" role="switch" id="flexSwitchCheckDefault"/>
  <label class="form-check-label" for="flexSwitchCheckDefault">Default switch checkbox input</label>
</div> */}



               </h4>
              <div>




<div style={{display:shwo? "":"none"}}>
              <u style={{color:"red",marginTop:"30px"}}><b>حدود الرواتب </b></u>
              <p>	اقل راتب القطاع الحكومي والعسكري <mark>5,000</mark></p>
              <p>	اقل راتب للقطاع الخاص المعتمد <mark>5,000</mark></p>
              <p>	اقل راتب للمتقاعدين  <mark>4.000</mark></p>
           



  <u style={{color:"red",marginTop:"30px"}}><b> التمويل الشخصي </b></u>
<li>	القطاع العسكري والحكومي والمتقاعدين بداية من اول راتب علي البنك </li>
<li>	القطاع الخاص المعتمد بداية من اول راتب علي البنك </li>
<li>	القطاع الخاص الغير معتمد لا يستحق تمويل شخصي </li>

<u style={{color:"red",marginTop:"30px"}}><b>التمويل العقاري    </b></u>

<li>	 التقاعد الفعلي للمدنيين 60 سنه بالإضافة الي 15 سنة تمديد(75) سنه</li>
<li>	التقاعد الفعلي للعساكر علي الرتبة الفعلية + 15 سنة تمديد بحد اقصي </li>
<li>	في حالة عدم انتظام الثلاث رواتب الأخيرة نعتمد علي متوسط الراتب</li>
<li>	الأفضل في حالة وجود اكثر من التزام توحيد الالتزامات في حاله رغبه العميل في الحصول علي اقصي مبلغ تمويل ( مده الالتزامات الاخري حتي التقاعد )</li>
<li>	شراء وحدة جاهزة من السوق -ارض وقرض-بناء ذاتي </li>
<u style={{color:"red",marginTop:"30px"}}><b>أولا : عميل البنك مدعوم</b></u>
<li>	الاستقطاع من الراتب في حاله الباقه او قسط الدعم  65% </li>
<li>	اقصي مدة للتمويل في حاله اضافه قسط الدعم جزء من الدخل 20 سنه
و في حاله عدم اضافه قسط الدعم علي الراتب او باقه الدعم 25 سنه</li>
<u style={{color:"red"}}><b>ثانيا : عميل البنك الغير مدعوم</b></u>
<li>	الراتب الأقل من 15.000 استقطاع 55%   </li>               
<li>	الراتب الاعلي من 15,000 استقطاع 65%</li>
<li>	مدة التمويل تصل الي 30 سنة</li>
<li>        (بالنسبة للعقار لا يحتاج شهادة الاشغال وبرنت اطلاق التيار)</li>

<u style={{color:"red",marginTop:"30px"}}><b>ثالثا : عميل بدون تحويل راتب  المدعوم و غير المدعوم </b></u>

<li>	لا يوجد في الوقت الراهن ...</li>
<u style={{color:"red"}}><b>الدعم  السكني</b></u>
<li>	قسط دعم شهري علي 20 سنه علي حسب الراتب</li>
<li>	باقة دعم  150.000  الرواتب اقل من 10.000 </li>
<li>	باقة دعم 100.000 الرواتب اكبر من 10.000 </li>

<hr></hr>
<u style={{color:"red",marginTop:"30px" }}><b>كيفية احتساب عميل الممتد   </b></u><br></br>
<u style={{color:"red"}}><b>أولا  الراتب التقاعدي الي 70 سنة  </b></u>

<li>	الفئة : جندي - عريف - وكيل رقيب</li>
<li>	60% من الراتب الصافي في حالة متبقي علي تقاعدة اقل من 5 سنوات</li>
<li>	70% من الراتب الصافي في حالة متبقي علي تقاعدة اكتر من 5 سنوات</li>
<u style={{color:"red",marginTop:"30px"}}><b>ثانيا  الراتب التقاعدي الي 75 سنة </b></u>

<li>	الفئة : رقيب - رئيس رقباء - ضباط- مدنين- القطاعات المعتمدة</li>
<li>	70% من الراتب الصافي في حالة متبقي علي تقاعدة اقل من 5 سنوات</li>
<li>	80% من الراتب الصافي في حالة متبقي علي تقاعدة اكتر من 5 سنوات</li>
<u style={{color:"red",marginTop:"30px"}}><b>القطاع الخاص الغير معتمد </b></u>

<li>	لابد من نزول 3 رواتب علي البنك </li>
<li>	اقل مدة خدمة 6 اشهر </li>
<li>	المحتسب علي التقاعد الفعلي </li>
<li>	 اعلي مبلغ تمويل 1,000,000</li>

<u style={{color:"red",marginTop:"30px"}}><b>ملاحظات </b></u>
<li>	الحد الاقصي لمده التمويل 15 سنة بعد التقاعد لجميع القطاعات</li>
<li>	تنطبق سياسة الممتد مع عميل البنك مدعوم او غير مدعوم </li>
<li>	في حاله كان الراتب اللي بينزل بالصراف +10% من الراتب اللي بالصراف اقل  من صافي التعريف يتم احتساب علي الصراف +10% الصراف </li>
</div>
              </div>
          
           </div>
        
           <div className="col-4 box bank">



           <h4 style={{color:"white" , marginTop:"10px" , textAlign:"center",padding:"5px"}}><b>سياسة الراجحي</b>
               <span >
               <button onClick={handleShow2} className="btn-show">

                
               <span>{shwo2?  <FontAwesomeIcon icon={faCircleMinus} flip="both" style={{color: "#374fc8",fontSize:"1.3rem"}} />:<FontAwesomeIcon icon={faCirclePlus} flip="both" style={{color: "#374fc8",fontSize:"1.3rem"}} />}
                  <span style={{padding:"10px"}}>{shwo2? "اخفاء":"اظهار" }
                  </span>
                  </span>
                  
               </button>
               </span>
               </h4>
              <div>




<div style={{display:shwo2? "":"none"}}>
              <u style={{color:"red",marginTop:"30px"}}><b>حدود الرواتب </b></u>
              <p>	اقل راتب في حاله قسط الدعم لجميع القطاعات يكون   بالصراف 5,000 و الإجمالي بالتعريف مع اضافه قسط الدعم  6,000 </p>
              <p>	اقل راتب في حاله الباقه او غير مدعوم يكون
              بالصراف  5,000 و الإجمالي بالتعريف 6,000     </p>
           





  <u style={{color:"red",marginTop:"30px"}}><b> التمويل الشخصي </b></u>
<li>	القطاع العسكري والحكومي والمتقاعدين والقطاعات المعتمدة  بداية من اول راتب علي البنك</li>
<li>	القطاع الخاص الغير معتمد لا يستحق تمويل شخصي </li>




<u style={{color:"red",marginTop:"30px"}}><b>التمويل العقاري</b></u>

<li>	 التقاعد الفعلي للمدنيين 60 سنه بالإضافة الي تمديد لـ عمر77</li>
<li>	التقاعد الفعلي للعساكر  الافراد علي الرتبة الفعلية + تمديد لـ عمر 70</li>
<li>		الأفضل للعساكر حاله الراتب الأساسي قليل تمويل الي التقاعد الفعلي</li>
<li>	  	المتقاعد حتي عمر 77 سنه</li>
<li>	شراء وحدة جاهزة من السوق -ارض وقرض-بناء ذاتي </li>

<u style={{color:"red",marginTop:"30px"}}><b>أولا : عميل البنك مدعوم</b></u>
<li>	الاستقطاع من الراتب في حاله الباقه او قسط الدعم  65% </li>
<li>اقصي مدة للتمويل 25 سنه</li>
<li>	لا بد من اضافه قسط الدعم علي الراتب بدلا من الباقه في حاله الراتب الإجمالي اقل من 6000</li>





<u style={{color:"red"}}><b>ثانيا : عميل البنك الغير مدعوم</b></u>
<li>	الراتب الأقل من 15.000 استقطاع 55%   </li>               
<li>	الراتب الاعلي من 15,000 استقطاع 65%</li>
<li>	مدة التمويل تصل الي 30 سنة</li>
<li>        (بالنسبة للعقار لا يحتاج شهادة الاشغال وبرنت اطلاق التيار)</li>


<u style={{color:"red",marginTop:"30px"}}><b>ثالثا : عميل بدون تحويل راتب  المدعوم و غير المدعوم </b></u>

<li>	الافراد  جندي الي رئيس رقباء – خاص غير معتمد ) لا يستحق بدون تحويل لابد من تحويل الراتب علي البنك</li>
<li>العملاء المدنيين والعساكر بداية من ملازم </li>
<li>اقل راتب للمدنيين والعسكرين ضباط و قطاع خاص المعتمد 7,500</li>


<u style={{color:"red"}}><b>الدعم  السكني</b></u>
<li>	قسط دعم شهري علي 25 سنه علي حسب الراتب</li>
<li>	باقة دعم  150.000  الرواتب اقل من 10.000 </li>
<li>	باقة دعم 100.000 الرواتب اكبر من 10.000 </li>

<hr></hr>
<u style={{color:"red",marginTop:"30px" }}><b>كيفية احتساب عميل الممتد   </b></u><br></br>
<li>الراتب التقاعدي للمدني اجمالي مده الخدمه السابقه و القادمه تقسيم 40 سنه ضرب الراتب الاساسي</li>
<li>الراتب التقاعدي للعساكر اجمالي مده الخدمه السابقه و القادمه تقسيم 35 سنه ضرب الراتب الاساسي</li>


<u style={{color:"red",marginTop:"30px"}}><b>القطاع الخاص الغير معتمد </b></u>
<li>الحد الأدنى للراتب 7.000</li>
<li>	لابد من نزول 6 رواتب علي البنك </li>
<li>	اقل مدة خدمة  سنه </li>
<li>	المحتسب علي التقاعد الفعلي </li>
<li>	 اعلي مبلغ تمويل 2,000,000</li>

<u style={{color:"red",marginTop:"30px"}}><b>ملاحظات </b></u>
<li>	الاستقطاع من الراتب في حاله باقة الدعم  65% </li>
<li>	امكانيه التضامن ولكن بدون الدعم السكنى حتي لو مستحق
و المحتسب على مدة التمويل الأقل للمتضامنيين</li>
</div>
              </div>










          
           </div>

           <div className="col-4 box bank">
           <h4 style={{color:"white" , marginTop:"10px" , textAlign:"center",padding:"5px"}}><b>سياسة البلاد</b>
               <span >
               <button onClick={handleShow3} className="btn-show">

                
               <span>{shwo3? <FontAwesomeIcon icon={faCircleMinus} flip="both" style={{color: "#374fc8",fontSize:"1.3rem"}} />:<FontAwesomeIcon icon={faCirclePlus} flip="both" style={{color: "#374fc8",fontSize:"1.3rem"}}/>}
                  <span style={{padding:"10px"}}>{shwo3? "اخفاء":"اظهار" }
                  </span>
                  </span>
                  
               </button>
               </span>
               </h4>
              <div>




<div style={{display:shwo3? "":"none"}}>
              <u style={{color:"red",marginTop:"30px"}}><b>حدود الرواتب </b></u>
              <p>	اقل راتب القطاع الحكومي والعسكري <mark>5,000</mark></p>
              <p>	اقل راتب للقطاع الخاص المعتمد <mark>5,000</mark></p>
              <p>	اقل راتب للمتقاعدين  <mark>4.000</mark></p>
           



  <u style={{color:"red",marginTop:"30px"}}><b> التمويل الشخصي </b></u>
<li>	القطاع العسكري والحكومي والمتقاعدين بداية من اول راتب علي البنك </li>
<li>	القطاع الخاص المعتمد بداية من اول راتب علي البنك </li>
<li>	القطاع الخاص الغير معتمد لا يستحق تمويل شخصي </li>

<u style={{color:"red",marginTop:"30px"}}><b>التمويل العقاري    </b></u>

<li>	 التقاعد الفعلي للمدنيين 60 سنه بالإضافة الي 15 سنة تمديد(75) سنه</li>
<li>	التقاعد الفعلي للعساكر علي الرتبة الفعلية + 15 سنة تمديد بحد اقصي </li>
<li>	في حالة عدم انتظام الثلاث رواتب الأخيرة نعتمد علي متوسط الراتب</li>
<li>	الأفضل في حالة وجود اكثر من التزام توحيد الالتزامات في حاله رغبه العميل في الحصول علي اقصي مبلغ تمويل ( مده الالتزامات الاخري حتي التقاعد )</li>
<li>	شراء وحدة جاهزة من السوق -ارض وقرض-بناء ذاتي </li>
<u style={{color:"red",marginTop:"30px"}}><b>أولا : عميل البنك مدعوم</b></u>
<li>	الاستقطاع من الراتب في حاله الباقه او قسط الدعم  65% </li>
<li>	اقصي مدة للتمويل في حاله اضافه قسط الدعم جزء من الدخل 20 سنه
و في حاله عدم اضافه قسط الدعم علي الراتب او باقه الدعم 25 سنه</li>
<u style={{color:"red"}}><b>ثانيا : عميل البنك الغير مدعوم</b></u>
<li>	الراتب الأقل من 15.000 استقطاع 55%   </li>               
<li>	الراتب الاعلي من 15,000 استقطاع 65%</li>
<li>	مدة التمويل تصل الي 30 سنة</li>
<li>        (بالنسبة للعقار لا يحتاج شهادة الاشغال وبرنت اطلاق التيار)</li>

<u style={{color:"red",marginTop:"30px"}}><b>ثالثا : عميل بدون تحويل راتب  المدعوم و غير المدعوم </b></u>

<li>	لا يوجد في الوقت الراهن ...</li>
<u style={{color:"red"}}><b>الدعم  السكني</b></u>
<li>	قسط دعم شهري علي 20 سنه علي حسب الراتب</li>
<li>	باقة دعم  150.000  الرواتب اقل من 10.000 </li>
<li>	باقة دعم 100.000 الرواتب اكبر من 10.000 </li>

<hr></hr>
<u style={{color:"red",marginTop:"30px" }}><b>كيفية احتساب عميل الممتد   </b></u><br></br>
<u style={{color:"red"}}><b>أولا  الراتب التقاعدي الي 70 سنة  </b></u>

<li>	الفئة : جندي - عريف - وكيل رقيب</li>
<li>	60% من الراتب الصافي في حالة متبقي علي تقاعدة اقل من 5 سنوات</li>
<li>	70% من الراتب الصافي في حالة متبقي علي تقاعدة اكتر من 5 سنوات</li>
<u style={{color:"red",marginTop:"30px"}}><b>ثانيا  الراتب التقاعدي الي 75 سنة </b></u>

<li>	الفئة : رقيب - رئيس رقباء - ضباط- مدنين- القطاعات المعتمدة</li>
<li>	70% من الراتب الصافي في حالة متبقي علي تقاعدة اقل من 5 سنوات</li>
<li>	80% من الراتب الصافي في حالة متبقي علي تقاعدة اكتر من 5 سنوات</li>
<u style={{color:"red",marginTop:"30px"}}><b>القطاع الخاص الغير معتمد </b></u>

<li>	لابد من نزول 3 رواتب علي البنك </li>
<li>	اقل مدة خدمة 6 اشهر </li>
<li>	المحتسب علي التقاعد الفعلي </li>
<li>	 اعلي مبلغ تمويل 1,000,000</li>

<u style={{color:"red",marginTop:"30px"}}><b>ملاحظات </b></u>
<li>	الحد الاقصي لمده التمويل 15 سنة بعد التقاعد لجميع القطاعات</li>
<li>	تنطبق سياسة الممتد مع عميل البنك مدعوم او غير مدعوم </li>
<li>	في حاله كان الراتب اللي بينزل بالصراف +10% من الراتب اللي بالصراف اقل  من صافي التعريف يتم احتساب علي الصراف +10% الصراف </li>
</div>
              </div>




           </div>


    

           <div className="col-4 box bank">

           <h4 style={{color:"white" , marginTop:"10px" , textAlign:"center",padding:"5px"}}><b>سياسة الانماء</b>
               <span >
               <button onClick={handleShow4} className="btn-show">

                
               <span>{shwo4? <FontAwesomeIcon icon={faCircleMinus} flip="both" style={{color: "#374fc8",fontSize:"1.3rem"}} />:<FontAwesomeIcon icon={faCirclePlus} flip="both" style={{color: "#374fc8",fontSize:"1.3rem"}}/>}
                  <span style={{padding:"10px"}}>{shwo4? "اخفاء":"اظهار" }
                  </span>
                  </span>
                  
               </button>
               </span>
               </h4>
              <div>




<div style={{display:shwo4? "":"none"}}>
              <u style={{color:"red",marginTop:"30px"}}><b>حدود الرواتب </b></u>
              <p>	اقل راتب القطاع الحكومي والعسكري <mark>5,000</mark></p>
              <p>	اقل راتب للقطاع الخاص المعتمد <mark>5,000</mark></p>
              <p>	اقل راتب للمتقاعدين  <mark>4.000</mark></p>
           



  <u style={{color:"red",marginTop:"30px"}}><b> التمويل الشخصي </b></u>
<li>	القطاع العسكري والحكومي والمتقاعدين بداية من اول راتب علي البنك </li>
<li>	القطاع الخاص المعتمد بداية من اول راتب علي البنك </li>
<li>	القطاع الخاص الغير معتمد لا يستحق تمويل شخصي </li>

<u style={{color:"red",marginTop:"30px"}}><b>التمويل العقاري    </b></u>

<li>	 التقاعد الفعلي للمدنيين 60 سنه بالإضافة الي 15 سنة تمديد(75) سنه</li>
<li>	التقاعد الفعلي للعساكر علي الرتبة الفعلية + 15 سنة تمديد بحد اقصي </li>
<li>	في حالة عدم انتظام الثلاث رواتب الأخيرة نعتمد علي متوسط الراتب</li>
<li>	الأفضل في حالة وجود اكثر من التزام توحيد الالتزامات في حاله رغبه العميل في الحصول علي اقصي مبلغ تمويل ( مده الالتزامات الاخري حتي التقاعد )</li>
<li>	شراء وحدة جاهزة من السوق -ارض وقرض-بناء ذاتي </li>
<u style={{color:"red",marginTop:"30px"}}><b>أولا : عميل البنك مدعوم</b></u>
<li>	الاستقطاع من الراتب في حاله الباقه او قسط الدعم  65% </li>
<li>	اقصي مدة للتمويل في حاله اضافه قسط الدعم جزء من الدخل 20 سنه
و في حاله عدم اضافه قسط الدعم علي الراتب او باقه الدعم 25 سنه</li>
<u style={{color:"red"}}><b>ثانيا : عميل البنك الغير مدعوم</b></u>
<li>	الراتب الأقل من 15.000 استقطاع 55%   </li>               
<li>	الراتب الاعلي من 15,000 استقطاع 65%</li>
<li>	مدة التمويل تصل الي 30 سنة</li>
<li>        (بالنسبة للعقار لا يحتاج شهادة الاشغال وبرنت اطلاق التيار)</li>

<u style={{color:"red",marginTop:"30px"}}><b>ثالثا : عميل بدون تحويل راتب  المدعوم و غير المدعوم </b></u>

<li>	لا يوجد في الوقت الراهن ...</li>
<u style={{color:"red"}}><b>الدعم  السكني</b></u>
<li>	قسط دعم شهري علي 20 سنه علي حسب الراتب</li>
<li>	باقة دعم  150.000  الرواتب اقل من 10.000 </li>
<li>	باقة دعم 100.000 الرواتب اكبر من 10.000 </li>

<hr></hr>
<u style={{color:"red",marginTop:"30px" }}><b>كيفية احتساب عميل الممتد   </b></u><br></br>
<u style={{color:"red"}}><b>أولا  الراتب التقاعدي الي 70 سنة  </b></u>

<li>	الفئة : جندي - عريف - وكيل رقيب</li>
<li>	60% من الراتب الصافي في حالة متبقي علي تقاعدة اقل من 5 سنوات</li>
<li>	70% من الراتب الصافي في حالة متبقي علي تقاعدة اكتر من 5 سنوات</li>
<u style={{color:"red",marginTop:"30px"}}><b>ثانيا  الراتب التقاعدي الي 75 سنة </b></u>

<li>	الفئة : رقيب - رئيس رقباء - ضباط- مدنين- القطاعات المعتمدة</li>
<li>	70% من الراتب الصافي في حالة متبقي علي تقاعدة اقل من 5 سنوات</li>
<li>	80% من الراتب الصافي في حالة متبقي علي تقاعدة اكتر من 5 سنوات</li>
<u style={{color:"red",marginTop:"30px"}}><b>القطاع الخاص الغير معتمد </b></u>

<li>	لابد من نزول 3 رواتب علي البنك </li>
<li>	اقل مدة خدمة 6 اشهر </li>
<li>	المحتسب علي التقاعد الفعلي </li>
<li>	 اعلي مبلغ تمويل 1,000,000</li>

<u style={{color:"red",marginTop:"30px"}}><b>ملاحظات </b></u>
<li>	الحد الاقصي لمده التمويل 15 سنة بعد التقاعد لجميع القطاعات</li>
<li>	تنطبق سياسة الممتد مع عميل البنك مدعوم او غير مدعوم </li>
<li>	في حاله كان الراتب اللي بينزل بالصراف +10% من الراتب اللي بالصراف اقل  من صافي التعريف يتم احتساب علي الصراف +10% الصراف </li>
</div>
              </div>


           </div>


           <div className="col-4 box bank">

           <h4 style={{color:"white" , marginTop:"10px" , textAlign:"center",padding:"5px"}}><b>سياسة ساب</b>
               <span >
               <button onClick={handleShow5} className="btn-show">

                
               <span>{shwo5? <FontAwesomeIcon icon={faCircleMinus} flip="both" style={{color: "#374fc8",fontSize:"1.3rem"}} />:<FontAwesomeIcon icon={faCirclePlus} flip="both" style={{color: "#374fc8",fontSize:"1.3rem"}}/>}
                  <span style={{padding:"10px"}}>{shwo5? "اخفاء":"اظهار" }
                  </span>
                  </span>
                  
               </button>
               </span>
               </h4>
              <div>




<div style={{display:shwo5? "":"none"}}>
              <u style={{color:"red",marginTop:"30px"}}><b>حدود الرواتب </b></u>
              <p>	اقل راتب القطاع الحكومي والعسكري <mark>5,000</mark></p>
              <p>	اقل راتب للقطاع الخاص المعتمد <mark>5,000</mark></p>
              <p>	اقل راتب للمتقاعدين  <mark>4.000</mark></p>
           



  <u style={{color:"red",marginTop:"30px"}}><b> التمويل الشخصي </b></u>
<li>	القطاع العسكري والحكومي والمتقاعدين بداية من اول راتب علي البنك </li>
<li>	القطاع الخاص المعتمد بداية من اول راتب علي البنك </li>
<li>	القطاع الخاص الغير معتمد لا يستحق تمويل شخصي </li>

<u style={{color:"red",marginTop:"30px"}}><b>التمويل العقاري    </b></u>

<li>	 التقاعد الفعلي للمدنيين 60 سنه بالإضافة الي 15 سنة تمديد(75) سنه</li>
<li>	التقاعد الفعلي للعساكر علي الرتبة الفعلية + 15 سنة تمديد بحد اقصي </li>
<li>	في حالة عدم انتظام الثلاث رواتب الأخيرة نعتمد علي متوسط الراتب</li>
<li>	الأفضل في حالة وجود اكثر من التزام توحيد الالتزامات في حاله رغبه العميل في الحصول علي اقصي مبلغ تمويل ( مده الالتزامات الاخري حتي التقاعد )</li>
<li>	شراء وحدة جاهزة من السوق -ارض وقرض-بناء ذاتي </li>
<u style={{color:"red",marginTop:"30px"}}><b>أولا : عميل البنك مدعوم</b></u>
<li>	الاستقطاع من الراتب في حاله الباقه او قسط الدعم  65% </li>
<li>	اقصي مدة للتمويل في حاله اضافه قسط الدعم جزء من الدخل 20 سنه
و في حاله عدم اضافه قسط الدعم علي الراتب او باقه الدعم 25 سنه</li>
<u style={{color:"red"}}><b>ثانيا : عميل البنك الغير مدعوم</b></u>
<li>	الراتب الأقل من 15.000 استقطاع 55%   </li>               
<li>	الراتب الاعلي من 15,000 استقطاع 65%</li>
<li>	مدة التمويل تصل الي 30 سنة</li>
<li>        (بالنسبة للعقار لا يحتاج شهادة الاشغال وبرنت اطلاق التيار)</li>

<u style={{color:"red",marginTop:"30px"}}><b>ثالثا : عميل بدون تحويل راتب  المدعوم و غير المدعوم </b></u>

<li>	لا يوجد في الوقت الراهن ...</li>
<u style={{color:"red"}}><b>الدعم  السكني</b></u>
<li>	قسط دعم شهري علي 20 سنه علي حسب الراتب</li>
<li>	باقة دعم  150.000  الرواتب اقل من 10.000 </li>
<li>	باقة دعم 100.000 الرواتب اكبر من 10.000 </li>

<hr></hr>
<u style={{color:"red",marginTop:"30px" }}><b>كيفية احتساب عميل الممتد   </b></u><br></br>
<u style={{color:"red"}}><b>أولا  الراتب التقاعدي الي 70 سنة  </b></u>

<li>	الفئة : جندي - عريف - وكيل رقيب</li>
<li>	60% من الراتب الصافي في حالة متبقي علي تقاعدة اقل من 5 سنوات</li>
<li>	70% من الراتب الصافي في حالة متبقي علي تقاعدة اكتر من 5 سنوات</li>
<u style={{color:"red",marginTop:"30px"}}><b>ثانيا  الراتب التقاعدي الي 75 سنة </b></u>

<li>	الفئة : رقيب - رئيس رقباء - ضباط- مدنين- القطاعات المعتمدة</li>
<li>	70% من الراتب الصافي في حالة متبقي علي تقاعدة اقل من 5 سنوات</li>
<li>	80% من الراتب الصافي في حالة متبقي علي تقاعدة اكتر من 5 سنوات</li>
<u style={{color:"red",marginTop:"30px"}}><b>القطاع الخاص الغير معتمد </b></u>

<li>	لابد من نزول 3 رواتب علي البنك </li>
<li>	اقل مدة خدمة 6 اشهر </li>
<li>	المحتسب علي التقاعد الفعلي </li>
<li>	 اعلي مبلغ تمويل 1,000,000</li>

<u style={{color:"red",marginTop:"30px"}}><b>ملاحظات </b></u>
<li>	الحد الاقصي لمده التمويل 15 سنة بعد التقاعد لجميع القطاعات</li>
<li>	تنطبق سياسة الممتد مع عميل البنك مدعوم او غير مدعوم </li>
<li>	في حاله كان الراتب اللي بينزل بالصراف +10% من الراتب اللي بالصراف اقل  من صافي التعريف يتم احتساب علي الصراف +10% الصراف </li>
</div>
              </div>


           </div>






           <div className="col-4 box bank">

           <h4 style={{color:"white" , marginTop:"10px" , textAlign:"center",padding:"5px"}}><b>سياسة الفرنسي</b>
               <span >
               <button onClick={handleShow6} className="btn-show">

                
               <span>{shwo6? <FontAwesomeIcon icon={faCircleMinus} flip="both" style={{color: "#374fc8",fontSize:"1.3rem"}} />:<FontAwesomeIcon icon={faCirclePlus} flip="both" style={{color: "#374fc8",fontSize:"1.3rem"}}/>}
                  <span style={{padding:"10px"}}>{shwo6? "اخفاء":"اظهار" }
                  </span>
                  </span>
                  
               </button>
               </span>
               </h4>
              <div>




<div style={{display:shwo6? "":"none"}}>
              <u style={{color:"red",marginTop:"30px"}}><b>حدود الرواتب </b></u>
              <p>	اقل راتب القطاع الحكومي والعسكري <mark>5,000</mark></p>
              <p>	اقل راتب للقطاع الخاص المعتمد <mark>5,000</mark></p>
              <p>	اقل راتب للمتقاعدين  <mark>4.000</mark></p>
           



  <u style={{color:"red",marginTop:"30px"}}><b> التمويل الشخصي </b></u>
<li>	القطاع العسكري والحكومي والمتقاعدين بداية من اول راتب علي البنك </li>
<li>	القطاع الخاص المعتمد بداية من اول راتب علي البنك </li>
<li>	القطاع الخاص الغير معتمد لا يستحق تمويل شخصي </li>

<u style={{color:"red",marginTop:"30px"}}><b>التمويل العقاري    </b></u>

<li>	 التقاعد الفعلي للمدنيين 60 سنه بالإضافة الي 15 سنة تمديد(75) سنه</li>
<li>	التقاعد الفعلي للعساكر علي الرتبة الفعلية + 15 سنة تمديد بحد اقصي </li>
<li>	في حالة عدم انتظام الثلاث رواتب الأخيرة نعتمد علي متوسط الراتب</li>
<li>	الأفضل في حالة وجود اكثر من التزام توحيد الالتزامات في حاله رغبه العميل في الحصول علي اقصي مبلغ تمويل ( مده الالتزامات الاخري حتي التقاعد )</li>
<li>	شراء وحدة جاهزة من السوق -ارض وقرض-بناء ذاتي </li>
<u style={{color:"red",marginTop:"30px"}}><b>أولا : عميل البنك مدعوم</b></u>
<li>	الاستقطاع من الراتب في حاله الباقه او قسط الدعم  65% </li>
<li>	اقصي مدة للتمويل في حاله اضافه قسط الدعم جزء من الدخل 20 سنه
و في حاله عدم اضافه قسط الدعم علي الراتب او باقه الدعم 25 سنه</li>
<u style={{color:"red"}}><b>ثانيا : عميل البنك الغير مدعوم</b></u>
<li>	الراتب الأقل من 15.000 استقطاع 55%   </li>               
<li>	الراتب الاعلي من 15,000 استقطاع 65%</li>
<li>	مدة التمويل تصل الي 30 سنة</li>
<li>        (بالنسبة للعقار لا يحتاج شهادة الاشغال وبرنت اطلاق التيار)</li>

<u style={{color:"red",marginTop:"30px"}}><b>ثالثا : عميل بدون تحويل راتب  المدعوم و غير المدعوم </b></u>

<li>	لا يوجد في الوقت الراهن ...</li>
<u style={{color:"red"}}><b>الدعم  السكني</b></u>
<li>	قسط دعم شهري علي 20 سنه علي حسب الراتب</li>
<li>	باقة دعم  150.000  الرواتب اقل من 10.000 </li>
<li>	باقة دعم 100.000 الرواتب اكبر من 10.000 </li>

<hr></hr>
<u style={{color:"red",marginTop:"30px" }}><b>كيفية احتساب عميل الممتد   </b></u><br></br>
<u style={{color:"red"}}><b>أولا  الراتب التقاعدي الي 70 سنة  </b></u>

<li>	الفئة : جندي - عريف - وكيل رقيب</li>
<li>	60% من الراتب الصافي في حالة متبقي علي تقاعدة اقل من 5 سنوات</li>
<li>	70% من الراتب الصافي في حالة متبقي علي تقاعدة اكتر من 5 سنوات</li>
<u style={{color:"red",marginTop:"30px"}}><b>ثانيا  الراتب التقاعدي الي 75 سنة </b></u>

<li>	الفئة : رقيب - رئيس رقباء - ضباط- مدنين- القطاعات المعتمدة</li>
<li>	70% من الراتب الصافي في حالة متبقي علي تقاعدة اقل من 5 سنوات</li>
<li>	80% من الراتب الصافي في حالة متبقي علي تقاعدة اكتر من 5 سنوات</li>
<u style={{color:"red",marginTop:"30px"}}><b>القطاع الخاص الغير معتمد </b></u>

<li>	لابد من نزول 3 رواتب علي البنك </li>
<li>	اقل مدة خدمة 6 اشهر </li>
<li>	المحتسب علي التقاعد الفعلي </li>
<li>	 اعلي مبلغ تمويل 1,000,000</li>

<u style={{color:"red",marginTop:"30px"}}><b>ملاحظات </b></u>
<li>	الحد الاقصي لمده التمويل 15 سنة بعد التقاعد لجميع القطاعات</li>
<li>	تنطبق سياسة الممتد مع عميل البنك مدعوم او غير مدعوم </li>
<li>	في حاله كان الراتب اللي بينزل بالصراف +10% من الراتب اللي بالصراف اقل  من صافي التعريف يتم احتساب علي الصراف +10% الصراف </li>
</div>
              </div>


           </div>

           <div className="col-4 box bank">

           <h4 style={{color:"white" , marginTop:"10px" , textAlign:"center",padding:"5px"}}><b>  دار التمليك</b>
               <span >
               <button onClick={handleShow7} className="btn-show">

                
               <span>{shwo7? <FontAwesomeIcon icon={faCircleMinus} flip="both" style={{color: "#374fc8",fontSize:"1.3rem"}} />:<FontAwesomeIcon icon={faCirclePlus} flip="both" style={{color: "#374fc8",fontSize:"1.3rem"}}/>}
                  <span style={{padding:"10px"}}>{shwo7? "اخفاء":"اظهار" }
                  </span>
                  </span>
                  
               </button>
               </span>
               </h4>
              <div>




<div style={{display:shwo7? "":"none"}}>
              <u style={{color:"red",marginTop:"30px"}}><b>حدود الرواتب </b></u>
              <p>	اقل راتب القطاع الحكومي والعسكري <mark>5,000</mark></p>
              <p>	اقل راتب للقطاع الخاص المعتمد <mark>5,000</mark></p>
              <p>	اقل راتب للمتقاعدين  <mark>4.000</mark></p>
           



  <u style={{color:"red",marginTop:"30px"}}><b> التمويل الشخصي </b></u>
<li>	القطاع العسكري والحكومي والمتقاعدين بداية من اول راتب علي البنك </li>
<li>	القطاع الخاص المعتمد بداية من اول راتب علي البنك </li>
<li>	القطاع الخاص الغير معتمد لا يستحق تمويل شخصي </li>

<u style={{color:"red",marginTop:"30px"}}><b>التمويل العقاري    </b></u>

<li>	 التقاعد الفعلي للمدنيين 60 سنه بالإضافة الي 15 سنة تمديد(75) سنه</li>
<li>	التقاعد الفعلي للعساكر علي الرتبة الفعلية + 15 سنة تمديد بحد اقصي </li>
<li>	في حالة عدم انتظام الثلاث رواتب الأخيرة نعتمد علي متوسط الراتب</li>
<li>	الأفضل في حالة وجود اكثر من التزام توحيد الالتزامات في حاله رغبه العميل في الحصول علي اقصي مبلغ تمويل ( مده الالتزامات الاخري حتي التقاعد )</li>
<li>	شراء وحدة جاهزة من السوق -ارض وقرض-بناء ذاتي </li>
<u style={{color:"red",marginTop:"30px"}}><b>أولا : عميل البنك مدعوم</b></u>
<li>	الاستقطاع من الراتب في حاله الباقه او قسط الدعم  65% </li>
<li>	اقصي مدة للتمويل في حاله اضافه قسط الدعم جزء من الدخل 20 سنه
و في حاله عدم اضافه قسط الدعم علي الراتب او باقه الدعم 25 سنه</li>
<u style={{color:"red"}}><b>ثانيا : عميل البنك الغير مدعوم</b></u>
<li>	الراتب الأقل من 15.000 استقطاع 55%   </li>               
<li>	الراتب الاعلي من 15,000 استقطاع 65%</li>
<li>	مدة التمويل تصل الي 30 سنة</li>
<li>        (بالنسبة للعقار لا يحتاج شهادة الاشغال وبرنت اطلاق التيار)</li>

<u style={{color:"red",marginTop:"30px"}}><b>ثالثا : عميل بدون تحويل راتب  المدعوم و غير المدعوم </b></u>

<li>	لا يوجد في الوقت الراهن ...</li>
<u style={{color:"red"}}><b>الدعم  السكني</b></u>
<li>	قسط دعم شهري علي 20 سنه علي حسب الراتب</li>
<li>	باقة دعم  150.000  الرواتب اقل من 10.000 </li>
<li>	باقة دعم 100.000 الرواتب اكبر من 10.000 </li>

<hr></hr>
<u style={{color:"red",marginTop:"30px" }}><b>كيفية احتساب عميل الممتد   </b></u><br></br>
<u style={{color:"red"}}><b>أولا  الراتب التقاعدي الي 70 سنة  </b></u>

<li>	الفئة : جندي - عريف - وكيل رقيب</li>
<li>	60% من الراتب الصافي في حالة متبقي علي تقاعدة اقل من 5 سنوات</li>
<li>	70% من الراتب الصافي في حالة متبقي علي تقاعدة اكتر من 5 سنوات</li>
<u style={{color:"red",marginTop:"30px"}}><b>ثانيا  الراتب التقاعدي الي 75 سنة </b></u>

<li>	الفئة : رقيب - رئيس رقباء - ضباط- مدنين- القطاعات المعتمدة</li>
<li>	70% من الراتب الصافي في حالة متبقي علي تقاعدة اقل من 5 سنوات</li>
<li>	80% من الراتب الصافي في حالة متبقي علي تقاعدة اكتر من 5 سنوات</li>
<u style={{color:"red",marginTop:"30px"}}><b>القطاع الخاص الغير معتمد </b></u>

<li>	لابد من نزول 3 رواتب علي البنك </li>
<li>	اقل مدة خدمة 6 اشهر </li>
<li>	المحتسب علي التقاعد الفعلي </li>
<li>	 اعلي مبلغ تمويل 1,000,000</li>

<u style={{color:"red",marginTop:"30px"}}><b>ملاحظات </b></u>
<li>	الحد الاقصي لمده التمويل 15 سنة بعد التقاعد لجميع القطاعات</li>
<li>	تنطبق سياسة الممتد مع عميل البنك مدعوم او غير مدعوم </li>
<li>	في حاله كان الراتب اللي بينزل بالصراف +10% من الراتب اللي بالصراف اقل  من صافي التعريف يتم احتساب علي الصراف +10% الصراف </li>
</div>
              </div>


           </div>

           <div className="col-4 box bank">

           <h4 style={{color:"white" , marginTop:"10px" , textAlign:"center",padding:"5px"}}><b>سياسة  بدايه</b>
               <span >
               <button onClick={handleShow8} className="btn-show">

                
               <span>{shwo8? <FontAwesomeIcon icon={faCircleMinus} flip="both" style={{color: "#374fc8",fontSize:"1.3rem"}} />:<FontAwesomeIcon icon={faCirclePlus} flip="both" style={{color: "#374fc8",fontSize:"1.3rem"}}/>}
                  <span style={{padding:"10px"}}>{shwo8? "اخفاء":"اظهار" }
                  </span>
                  </span>
                  
               </button>
               </span>
               </h4>
              <div>




<div style={{display:shwo8? "":"none"}}>
              <u style={{color:"red",marginTop:"30px"}}><b>حدود الرواتب </b></u>
              <p>	اقل راتب القطاع الحكومي والعسكري <mark>5,000</mark></p>
              <p>	اقل راتب للقطاع الخاص المعتمد <mark>5,000</mark></p>
              <p>	اقل راتب للمتقاعدين  <mark>4.000</mark></p>
           



  <u style={{color:"red",marginTop:"30px"}}><b> التمويل الشخصي </b></u>
<li>	القطاع العسكري والحكومي والمتقاعدين بداية من اول راتب علي البنك </li>
<li>	القطاع الخاص المعتمد بداية من اول راتب علي البنك </li>
<li>	القطاع الخاص الغير معتمد لا يستحق تمويل شخصي </li>

<u style={{color:"red",marginTop:"30px"}}><b>التمويل العقاري    </b></u>

<li>	 التقاعد الفعلي للمدنيين 60 سنه بالإضافة الي 15 سنة تمديد(75) سنه</li>
<li>	التقاعد الفعلي للعساكر علي الرتبة الفعلية + 15 سنة تمديد بحد اقصي </li>
<li>	في حالة عدم انتظام الثلاث رواتب الأخيرة نعتمد علي متوسط الراتب</li>
<li>	الأفضل في حالة وجود اكثر من التزام توحيد الالتزامات في حاله رغبه العميل في الحصول علي اقصي مبلغ تمويل ( مده الالتزامات الاخري حتي التقاعد )</li>
<li>	شراء وحدة جاهزة من السوق -ارض وقرض-بناء ذاتي </li>
<u style={{color:"red",marginTop:"30px"}}><b>أولا : عميل البنك مدعوم</b></u>
<li>	الاستقطاع من الراتب في حاله الباقه او قسط الدعم  65% </li>
<li>	اقصي مدة للتمويل في حاله اضافه قسط الدعم جزء من الدخل 20 سنه
و في حاله عدم اضافه قسط الدعم علي الراتب او باقه الدعم 25 سنه</li>
<u style={{color:"red"}}><b>ثانيا : عميل البنك الغير مدعوم</b></u>
<li>	الراتب الأقل من 15.000 استقطاع 55%   </li>               
<li>	الراتب الاعلي من 15,000 استقطاع 65%</li>
<li>	مدة التمويل تصل الي 30 سنة</li>
<li>        (بالنسبة للعقار لا يحتاج شهادة الاشغال وبرنت اطلاق التيار)</li>

<u style={{color:"red",marginTop:"30px"}}><b>ثالثا : عميل بدون تحويل راتب  المدعوم و غير المدعوم </b></u>

<li>	لا يوجد في الوقت الراهن ...</li>
<u style={{color:"red"}}><b>الدعم  السكني</b></u>
<li>	قسط دعم شهري علي 20 سنه علي حسب الراتب</li>
<li>	باقة دعم  150.000  الرواتب اقل من 10.000 </li>
<li>	باقة دعم 100.000 الرواتب اكبر من 10.000 </li>

<hr></hr>
<u style={{color:"red",marginTop:"30px" }}><b>كيفية احتساب عميل الممتد   </b></u><br></br>
<u style={{color:"red"}}><b>أولا  الراتب التقاعدي الي 70 سنة  </b></u>

<li>	الفئة : جندي - عريف - وكيل رقيب</li>
<li>	60% من الراتب الصافي في حالة متبقي علي تقاعدة اقل من 5 سنوات</li>
<li>	70% من الراتب الصافي في حالة متبقي علي تقاعدة اكتر من 5 سنوات</li>
<u style={{color:"red",marginTop:"30px"}}><b>ثانيا  الراتب التقاعدي الي 75 سنة </b></u>

<li>	الفئة : رقيب - رئيس رقباء - ضباط- مدنين- القطاعات المعتمدة</li>
<li>	70% من الراتب الصافي في حالة متبقي علي تقاعدة اقل من 5 سنوات</li>
<li>	80% من الراتب الصافي في حالة متبقي علي تقاعدة اكتر من 5 سنوات</li>
<u style={{color:"red",marginTop:"30px"}}><b>القطاع الخاص الغير معتمد </b></u>

<li>	لابد من نزول 3 رواتب علي البنك </li>
<li>	اقل مدة خدمة 6 اشهر </li>
<li>	المحتسب علي التقاعد الفعلي </li>
<li>	 اعلي مبلغ تمويل 1,000,000</li>

<u style={{color:"red",marginTop:"30px"}}><b>ملاحظات </b></u>
<li>	الحد الاقصي لمده التمويل 15 سنة بعد التقاعد لجميع القطاعات</li>
<li>	تنطبق سياسة الممتد مع عميل البنك مدعوم او غير مدعوم </li>
<li>	في حاله كان الراتب اللي بينزل بالصراف +10% من الراتب اللي بالصراف اقل  من صافي التعريف يتم احتساب علي الصراف +10% الصراف </li>
</div>
              </div>


           </div>











           </div>
        </div>
    )
}